import os


class Config:
    VERSION = "v4.5.4"
    APP_NAME = "Elves"
    APP_DATA = os.getenv("LOCALAPPDATA") + f"/{APP_NAME}"
    LOGS_PATH = os.getenv("LOCALAPPDATA") + f"/{APP_NAME}" + "/logs"
    USER_CONFIG_PATH = APP_DATA + r"\Config\User"
    SYS_CONFIG_PATH = APP_DATA + r"\Config\Sys"
    STORAGE_PATH = APP_DATA + r"\pywebview"
    THRESHOLD = 0.85
    BOX = (0, 0, 1335, 750)
    TIMEOUT = 1.2
    OVERTIME = 1.8
    TIMES = 3
    SWITCH_CHARACTER_STATE = {}
    THRESHOLD_IMAGE = {
        "标志副本完成": 0.7,
        "标志寻路中": 0.7,
        "按钮世界挂机": 0.75,
        "标志地图加载": 0.65,
        "标志地图加载_1": 0.65,
        "标志地图加载_V1": 0.65,
        "标志大世界修炼中": 0.7,
        "按钮地图世界区域": 0.8,
        "按钮任务帮派": 0.8,
        "按钮关闭": 0.7,
        "按钮关闭_V1": 0.7,
        "按钮关闭_V2": 0.7,
        "按钮关闭_V3": 0.7,
        "按钮商城购买": 0.9,
        "标志江湖行商参与条件": 0.95,
        "标志单人论剑匹配成功": 0.98,
        "标志多人论剑匹配成功": 0.98,
        "按钮活动摇钱树": 0.9,
        "标志悬赏接满": 0.9,
        "按钮课业确定": 0.8,
        "按钮江湖急送菜品打包": 0.9,
        "标志本体位置": 0.8,
        "标志本体位置_V2": 0.8,
        "标志本体位置_V3": 0.8,
        "按钮大世界对话": 0.8,
        "标志江湖英雄榜敌方": 0.9,
        "按钮课业课业": 0.9,
        "按钮课业悟禅": 0.9,
        "标志单人论剑我方": 0.9,
        "标志大世界体力上限": 0.9,
        "按钮大世界采集": 0.75,
        "按钮大世界砍伐": 0.75,
        "按钮大世界挖矿": 0.75,
        "按钮大世界拾取": 0.75,
        "按钮大世界搜查": 0.75,
        "按钮大世界垂钓": 0.75,
        "按钮大世界市井喧闹": 0.75,
        "按钮大世界繁花似锦": 0.75,
        "按钮大世界空山鸟语": 0.75,
        "标志大世界采集加速": 0.75,
        "按钮大世界试穿": 0.8,
        "按钮大世界清扫": 0.8,
        "按钮大世界清扫_V1": 0.8,
        "标志0": 0.9,
        "标志1": 0.9,
        "标志2": 0.9,
        "标志3": 0.9,
        "标志4": 0.9,
        "标志5": 0.9,
        "标志6": 0.9,
        "标志7": 0.9,
        "标志8": 0.9,
        "标志9": 0.9,
    }
    COLLECTION_ARTICLES_DICt = {
        "江南杂草": ["江南", ["1764#966"]],
        "江南野花": ["江南", ["1756#981"]],
        "江南朱果": ["江南",
                     ["970#1672", "967#1665", "951#1653", "963#1607", "970#1604", "995#1573", "987#1571", "953#1582",
                      "935#1544", "933#1540", "928#1526", "949#1529"]],
        "少林地灵果": ["少林", ["222#553", "193#531", "186#544", "189#530", "163#458", "156#452", "133#438", "57#445",
                                "267#514", "55#452", "278#447", "281#441", "288#457", "291#453"]],
        "华山灵芝": ["华山",
                     ["169#62", "228#72", "66#40", "296#169", "361#131", "342#146", "363#96", "378#80", "0#348"]],
        "风雷岛枯木": ["风雷岛", ["570#463", "562#462"]],
        "金陵翠竹": ["金陵", ["804#764"]],
        "江南枫木": ["江南", ["1054#538", "1097#486", "1139#439"]],
        "江南榆木": ["江南", ["1152#1646", "1202#1562", "1274#1619", "1250#1711", "1206#1731"]],
        "江南松木": ["江南",
                     ["1099#680", "1098#610", "1099#581", "1089#562", "1044#581", "998#495", "970#467", "1002#449",
                      "946#549", "1266#756", "1296#744", "1345#788", "1335#795", "1354#710", "1370#697"]],
        "江南桉木": ["江南", ["928#745", "1732#601", "1550#901"]],
        "中原碎石": ["中原", ["1055#1738"]],
        "中原黄铜": ["中原", ["924#1689"]],
        "中原立银": ["中原", ["984#1640", "978#1622", "965#1615", "1284#1537"]],
        "塞北金矿": ["塞北", ["1552#1786", "1526#1803"]],
        "塞北祖母绿": ["塞北", ["1579#1788", "1575#1802", "1565#1790"]],
        "塞北钨晶": ["塞北", ["1554#1824", "1566#1824", "1575#1829", "1585#1841"]],
        "江南碎鸡蛋": ["江南", ["1560#848", "1018#1234"]],
        "江南石灰": ["江南", ["1169#1138", "1045#1134", "996#1232"]],
        "江南烂木头": ["江南", ["1213#1138", "1483#976", "1497#1006"]],
    }

    IMAGE_PARAMETER_DICT = {
        "按钮物品综合入口": {"prefix": None, "verify": None, "action": "打开背包"},
        "按钮物品活动": {"prefix": None, "verify": ["按钮物品综合入口"], "action": None},
        "按钮活动江湖": {"prefix": ["界面活动"], "verify": ["按钮物品活动"], "action": None},
        "按钮活动游历": {"prefix": ["界面活动"], "verify": ["按钮物品活动"], "action": None},
        "按钮活动帮派": {"prefix": ["界面活动"], "verify": ["按钮物品活动"], "action": None},
        "按钮活动纷争": {"prefix": ["界面活动"], "verify": ["按钮物品活动"], "action": None},
        "按钮活动悬赏": {"prefix": ["界面活动"], "verify": ["按钮物品活动"], "action": None},
        "按钮悬赏发布": {"prefix": None, "verify": ["按钮活动悬赏"], "action": None},
        "按钮发布悬赏下拉": {"prefix": None, "verify": ["按钮悬赏发布"], "action": None},

    }
    KEY_LIST = [
        'DIGIT2', 'DIGIT3', 'DIGIT4', 'DIGIT5', 'DIGIT6', 'DIGIT7', 'DIGIT8', 'DIGIT9',
        '', '', '', '', 'DIGIT1', 'R', 'F', 'Z',
        'W', 'S', 'A', 'D', 'B', 'O', 'T', 'M',
        'H', 'ESCAPE'
    ]
