"""应用设置配置"""
import os
from pathlib import Path


class Settings:
    """应用设置"""
    # 应用基础路径
    APP_NAME = "Elves"
    BASE_DIR = os.path.join(os.getenv("LOCALAPPDATA", ""), APP_NAME)
    # 日志配置
    LOGS_PATH = Path(BASE_DIR) / "logs"
    LOG_FILE = LOGS_PATH / "app.log"
    LOG_MAX_BYTES = 5 * 1024 * 1024  # 5MB
    LOG_BACKUP_COUNT = 5
    LOG_ENCODING = "utf-8"

    # WebView 配置
    WEBVIEW2_RUNTIME_PATH = "WebView2"

    # 默认URL
    DEFAULT_URL = "https://elves.elarion.cn:5277"

    # 日志格式
    LOG_FORMAT = (
        '%(asctime)s - %(name)s - %(levelname)s - '
        '%(filename)s:%(lineno)d - %(message)s'
    )
    LOG_DATE_FORMAT = '%Y-%m-%d %H:%M:%S'
    THRESHOLD = 0.85
    THRESHOLD_IMAGE = {
        # 0.65
        "标志地图加载": 0.65,
        "标志地图加载_1": 0.65,
        "标志地图加载_V1": 0.65,

        # 0.7
        "标志副本完成": 0.7,
        "标志江湖行商商人": 0.7,
        "标志寻路中": 0.7,
        "标志大世界修炼中": 0.7,
        "按钮关闭": 0.7,
        "按钮关闭_V1": 0.7,
        "按钮关闭_V2": 0.7,
        "按钮关闭_V3": 0.7,
        # 0.75
        "按钮大世界采集": 0.75,
        "按钮大世界砍伐": 0.75,
        "按钮大世界挖矿": 0.75,
        "按钮大世界拾取": 0.75,
        "按钮大世界搜查": 0.75,
        "按钮大世界垂钓": 0.75,
        "按钮大世界市井喧闹": 0.75,
        "按钮大世界繁花似锦": 0.75,
        "按钮大世界空山鸟语": 0.75,
        "标志大世界采集加速": 0.75,
        "按钮世界挂机": 0.75,

        # 0.8
        "按钮大世界试穿": 0.8,
        "按钮大世界清扫": 0.8,
        "按钮大世界清扫_V1": 0.8,
        "标志本体位置": 0.8,
        "标志本体位置_V2": 0.8,
        "标志本体位置_V3": 0.8,
        "按钮大世界对话": 0.8,
        "按钮课业确定": 0.8,

        "按钮地图世界区域": 0.8,
        "按钮任务帮派": 0.8,
        # 0.85

        # 0.9
        "标志江湖英雄榜敌方": 0.9,
        "按钮大世界坐骑": 0.9,
        "按钮课业课业": 0.9,
        "按钮课业悟禅": 0.9,
        "标志单人论剑我方": 0.9,
        "标志大世界体力上限": 0.9,
        "标志0": 0.9,
        "标志1": 0.9,
        "标志2": 0.9,
        "标志3": 0.9,
        "标志4": 0.9,
        "标志5": 0.9,
        "标志6": 0.9,
        "标志7": 0.9,
        "标志8": 0.9,
        "标志9": 0.9,
        "按钮活动摇钱树": 0.9,
        "标志悬赏接满": 0.9,
        "按钮江湖急送菜品打包": 0.9,
        "按钮商城购买": 0.9,

        # 0.95
        "标志江湖行商参与条件": 0.95,

        # 0.98
        "标志单人论剑匹配成功": 0.98,
        "标志多人论剑匹配成功": 0.98,

    }


settings = Settings()
